In [ ]:
import pandas as pd

In [ ]:
s = pd.Series([3, 2, 0, 1], name="apples")
s

0    3
1    2
2    0
3    1
Name: apples, dtype: int64

In [ ]:
lst = ['Apple', 'Orange', 'Banana', 'PineApple', 'Durian']

df = pd.DataFrame(lst)
df

           0
0      Apple
1     Orange
2     Banana
3  PineApple
4     Durian

In [ ]:
data = {'apple': [3, 4, 0, 1],
        'oranges': [0, 3, 7 ,2]
        }

In [ ]:
df = pd.DataFrame(data)
df

   apple  oranges
0      3        0
1      4        3
2      0        7
3      1        2

In [ ]:
data = {'apple': ['Tom', 'nick', 'krish', 'jack'],
        'oranges': [20, 21, 19, 18]
        }

df = pd.DataFrame(data)
df

   apple  oranges
0    Tom       20
1   nick       21
2  krish       19
3   jack       18

In [ ]:
data = {'Name': ['Jai', 'Somchai', 'Somsee', 'Lek'],
        'Age': [27, 24, 22, 32],
        'Address': ['Banfkok', 'Rayong', 'Chantaburi', 'Chonburi'],
        'Qualufication': ['Msc', 'Ma', 'MCA', 'Phs']
        }

df = pd.DataFrame(data)

df[['Name', 'Qualufication']]

      Name Qualufication
0      Jai           Msc
1  Somchai            Ma
2   Somsee           MCA
3      Lek           Phs

In [ ]:
df.loc[0]

Name                 Jai
Age                   27
Address          Banfkok
Qualufication        Msc
Name: 0, dtype: object

In [ ]:
df1 = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])

df1

           Name  Age     Address Qualufication
June        Jai   27     Banfkok           Msc
Robert  Somchai   24      Rayong            Ma
Lily     Somsee   22  Chantaburi           MCA
David       Lek   32    Chonburi           Phs

In [ ]:
df1.loc['June']

Name                 Jai
Age                   27
Address          Banfkok
Qualufication        Msc
Name: June, dtype: object

In [ ]:
df = pd.read_csv('/content/drive/My Drive/88950162_tools_for_data_science_101/pandas_data/rainfall.csv')

df
# df['Month']
# df.head()
# df.tall()
# df.info()
# df.shape

        Month  Rainfall  Temperature
0     January      1.65          3.0
1     Febuary      1.25         10.0
2       March      1.94         15.0
3       April      2.75         20.0
4         May      3.14         25.0
5        June      3.65         24.0
6        July      5.05         30.0
7      August      1.50          1.0
8   September      1.33         33.0
9     October       NaN          NaN
10   November      0.50         32.0
11   December      2.30          2.3

In [ ]:
df = pd.read_csv('/content/drive/My Drive/88950162_tools_for_data_science_101/pandas_data/rainfall.csv', index_col=0)
# df = pd.read_csv('/content/drive/My Drive/88950162_tools_for_data_science_101/pandas_data/rainfall.csv', index_col='Month')

df
# df['Rainfall']
# df.loc['January']
# df.iloc[1]

           Rainfall  Temperature
Month
January        1.65          3.0
Febuary        1.25         10.0
March          1.94         15.0
April          2.75         20.0
May            3.14         25.0
June           3.65         24.0
July           5.05         30.0
August         1.50          1.0
September      1.33         33.0
October         NaN          NaN
November       0.50         32.0
December       2.30          2.3

In [ ]:
df = pd.read_csv('/content/drive/My Drive/88950162_tools_for_data_science_101/pandas_data/rainfall.csv')
df.set_index('Month')

df.reset_index
df

        Month  Rainfall  Temperature
0     January      1.65          3.0
1     Febuary      1.25         10.0
2       March      1.94         15.0
3       April      2.75         20.0
4         May      3.14         25.0
5        June      3.65         24.0
6        July      5.05         30.0
7      August      1.50          1.0
8   September      1.33         33.0
9     October       NaN          NaN
10   November      0.50         32.0
11   December      2.30          2.3

In [ ]:
import numpy as np

dict = {'First':[100, 90, np.nan, 95],
        'Second': [30, 45, 56, np.nan],
        'Third': [np.nan, 40, 80, 98]}

df - pd.DataFrame(dict)

df.isnull()

    Month  Rainfall  Temperature
0   False     False        False
1   False     False        False
2   False     False        False
3   False     False        False
4   False     False        False
5   False     False        False
6   False     False        False
7   False     False        False
8   False     False        False
9   False      True         True
10  False     False        False
11  False     False        False

In [ ]:
df1 = df.fillna(0)
print(df1)

df2 = df.dropna()
df2

        Month  Rainfall  Temperature
0     January      1.65          3.0
1     Febuary      1.25         10.0
2       March      1.94         15.0
3       April      2.75         20.0
4         May      3.14         25.0
5        June      3.65         24.0
6        July      5.05         30.0
7      August      1.50          1.0
8   September      1.33         33.0
9     October      0.00          0.0
10   November      0.50         32.0
11   December      2.30          2.3

        Month  Rainfall  Temperature
0     January      1.65          3.0
1     Febuary      1.25         10.0
2       March      1.94         15.0
3       April      2.75         20.0
4         May      3.14         25.0
5        June      3.65         24.0
6        July      5.05         30.0
7      August      1.50          1.0
8   September      1.33         33.0
10   November      0.50         32.0
11   December      2.30          2.3

In [ ]:
test = df[df['Rainfall'] > 2]
test

       Month  Rainfall  Temperature
3      April      2.75         20.0
4        May      3.14         25.0
5       June      3.65         24.0
6       July      5.05         30.0
11  December      2.30          2.3

In [ ]:
test = df[(df['Rainfall'] > 2) & (df['Rainfall'] < 3)]
test

       Month  Rainfall  Temperature
3      April      2.75         20.0
11  December      2.30          2.3

In [ ]:
df = pd.read_csv('/content/drive/My Drive/88950162_tools_for_data_science_101/pandas_data/titanic.csv')
test = df[(df['Rainfall'] > 2) & (df['Rainfall'] < 3)]
test

In [ ]:
test1 = df[df['Pclass'].isin([2, 3])]
test1

In [ ]:
test = df[(df['Pclass'] == 2) | (df['Pclass'] == 3)]
test

In [ ]:
test1 = df[df['Age'].notna()]
test1

In [ ]:
test1 = df.loc[df['Age'] > 35, 'Name']
test1

In [ ]:
movie_df = pd.read_csv('/content/drive/My Drive/88950162_tools_for_data_science_101/pandas_data/IMDB-Movie-Data.csv', index_col='Title')
movie_df

In [ ]:
temp_df = movie_df.append(movie_df)
temp_df

In [ ]:
temp_df = temp_df.drop_duplicates()
temp_df

In [ ]:
temp_df.drop_duplicates(inplace=True)
temp_df

In [ ]:
temp_df.isnull().sum()

In [ ]:
temp_df.dropna()

In [ ]:
temp_df.dropna(axis=1)

In [ ]:
temp_df.sum()

In [ ]:
revenue = movie_df['Revenue (Millions)']
revenue

In [ ]:
revenue_mean = revenue.mean()
revenue_mean

In [ ]:
revenue.fillna(revenue_mean, inplace=True)
revenue

In [ ]:
movie_df.isnull().sum()

In [ ]:
metascore = movie_df['Metascore']
metascore

In [ ]:
metascore_mean = metascore.mean()
metascore_mean

In [ ]:
metascore.fillna(metascore_mean, inplace=True)
metascore

In [ ]:
movie_df.isnull().sum()

In [ ]:
movie_df.describe()

In [ ]:
movie_df['Genre'].describe()

In [ ]:
movie_df['Genre'].value_counts()

In [ ]:
df = pd.read_csv('/content/drive/My Drive/88950162_tools_for_data_science_101/pandas_data/titanic.csv')
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [ ]:
male_age_and_class1 = df[(df['Sex'] == 'male') & (df['Age'] >= 40) & (df['Age'] <= 50) & (df['Pclass'] == 1)]
male_age_and_class1.shape

(27, 12)